Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: ནམ་མཁའི་དབྱིངས་ལ་འཁོད་པའི་ལྷའི་ཚོགས་དང་། རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་ཞིང་ཡང་དག་པར་བསྐུལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཕོ་ཉ་ལྟར་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འདི་སྐད་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་ཐུགས་ཤིན་ཏུ་དགྱེས་པར་འགྱུར་བ་ཡིན།
en: While he thus wept and wailed, the devas who were assembled in the sky, who were bodhisattva devas, emissaries of the buddhas who continually followed him and inspired him, called down to him, “Noble one, the bodhisattvas who follow the instructions of the kalyāṇamitras greatly please the buddha bhagavats.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཚིག་དང་། མི་འགལ་བར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུའང་ཤིན་ཏུ་བསྙེན་པ་ཡིན།
en: The bodhisattvas who never go against the words of the kalyāṇamitras come close to omniscience.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཚིག་ལ་ཐེ་ཙོམ་མི་ཟ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ཀྱང་ཉེ་བར་བསྙེན་པ་ཡིན།
en: The bodhisattvas who do not doubt the words of the kalyāṇamitras come close to the kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་དོན་ཐམས་ཅད་ཀྱང་མངོན་དུ་འགྱུར་བ་ཡིན་གྱིས།
en: The bodhisattvas who always have the kalyāṇamitras in their minds are approaching all their goals.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོའི་ཕོ་བྲང་བརྟན་པར་དགེ་བསྙེན་མ་མི་གཡོ་བ་གང་ན་བ་དེར་སོང་ཤིག་དང་། དེ་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐོས་པར་འགྱུར་རོ།
en: “Noble one, go to the upāsikā Acalā in the royal capital of Sthirā! You will hear the bodhisattva conduct from her.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་སྣང་བ་ལས་ལངས་ནས་མཐར་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་བརྟན་པར་དགེ་བསྙེན་མ་མི་གཡོ་བ་གང་ན་བ་དེར་སོང་ནས།
en: Then Sudhana, the head merchant’s son, emerged from samādhi’s light of wisdom and eventually arrived at Sthirā, where the upāsikā Acalā was.

source: དགེ་བསྙེན་མ་མི་གཡོ་བ་ཡོངས་སུ་ཚོལ་ཞིང་རྨེད་རྨེད་པ་ལས། དེ་ལ་འགྲོ་བ་མང་པོས་བསྟན་པ། རིགས་ཀྱི་བུ་དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ནི་རང་གི་ཁྱིམ་ན་ཕ་མ་དང་། འགྲོགས་ཤིང་གཞོན་ནུར་གྱུར་པ་སྟེ། རང་གི་གཉེན་བཤེས་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ལ་ཆོས་སྟོན་ཏོ།
en: He searched and looked for the upāsikā Acalā, and many people said to him, “Noble one, the upāsikā Acalā is young and lives with her parents at home, where, surrounded by her family, she teaches the Dharma to a great gathering of people.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་བ་ཆེན་པོ་དང་། མོས་ཤིང་སྤྲོ་བས། ཡོངས་སུ་རྒྱས་པའི་སེམས་དང་ལྡན་པ་དེ་དགེ་བསྙེན་མ་མི་གཡོ་བའི་ཁྱིམ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then Sudhana, the head merchant’s son, his mind filled with great happiness, enthusiasm, and joy, went to the home of the upāsikā Acalā.

source: དགེ་བསྙེན་མ་མི་གཡོ་བའི་ཁྱིམ་གྱི་སྒོ་ན་སྡོད་པའི་ཚེ། དེས་ཁྱིམ་དེ་ཐམས་ཅད་འོད་ལུས་དང་སེམས་ཤིན་ཏུ་བདེ་བར་བྱེད་པ། གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ་ཞིག་གིས་ཁྱབ་ཅིང་གསལ་བར་གྱུར་ནས།
en: After arriving there, while he was waiting at the door he saw the entire house shining with a pervading golden light that brought ease to mind and body.

source: འོད་དེས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཕོག་པར་གྱུར་མ་ཐག་ཏུ་ཚོར་བ་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། ཞི་བའི་གནས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། འགྲོ་བ་ཐམས་ཅད་དང་བྲལ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། ཀུན་ཏུ་ལྟ་བའི་བཏང་སྙོམས་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་དང་། དེ་བཞིན་གཤེགས་པའི་མཛོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་ལ་སྩོགས་པ། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ལྔ་བརྒྱ་ཙམ་ལ་ཞུགས་པར་གྱུར་ཏེ། ཡོངས་སུ་སྐྱེས་སོ། །དེ་དག་ཀྱང་ཤིན་ཏུ་ཕྲ་ཞིང་གཞོན་པ་སྟེ།
en: The instant the light touched Sudhana, the head merchant’s son, he entered, and there arose five hundred subtle and newly developed entrances to samādhi such as entrances to the samādhi called power over all sensations, entrances to the samādhi called the region of peace, entrances to the samādhi called apart fromall beings, entrances to the samādhi called the all-seeing equanimity, and entrances to the samādhi called the treasure of the tathāgatas.

source: འདི་ལྟར་དཔེར་ན་ཐོག་མ་མངལ་དུ་ཞུགས་པའི་རྣམ་པར་ཤེས་པ་ལྟ་བུ་སྟེ། ཏིང་ངེ་འཛིན་དེ་དག་ཀྱང་ཤིན་ཏིུ་ཕྲ་ཞིང་གཞོན་པར་སྐྱེས་པར་གྱུར་ཏོ།
en: Those samādhis were very subtle and newly developed like a consciousness that has just entered the womb.

source: །དེས་དྲི་ཞིམ་པོ་ཞིག་ཚོར་ནའང་དེ་ནི་ལྷ་ལའང་མེད་ལྷའི་བུ་མོ་ལ་ཡང་མེད། ཀླུ་ལ་ཡང་མེད་ཀླུའི་བུ་མོ་ལ་ཡང་མེད། གནོད་སྦྱིན་ལ་ཡང་མེད་གནོད་སྦྱིན་གྱི་བུ་མོ་ལ་ཡང་མེད། དྲི་ཟ་ལ་ཡང་མེད། དྲི་ཟའི་བུ་མོ་ལ་ཡང་མེད། ལྷ་མ་ཡིན་ལ་ཡང་མེད། ལྷ་མ་ཡིན་གྱི་བུ་མོ་ཡང་མེད། ནམ་མཁའི་ལྡིང་ལ་ཡང་མེད།
en: Then Sudhana sensed a lovely scent of such a kind that male devas did not have, that female devas did not have, that male nāgas did not have, that female nāgas did not have, that male yakṣas did not have, that female yakṣas did not have, that male gandharvas did not have, that female gandharvas did not have, that male asuras did not have, that female asuras did not have, that male garuḍas did not have, that female garuḍas did not have, that male kinnaras did not have, that female kinnaras did not have, that male mahoragas did not have, that female mahoragas did not have, that male humans did not have, and that female humans did not have.

source: ནམ་མཁའ་ལྡིང་གི་བུ་མོ་ལ་ཡང་མེད། མིའམ་ཅི་ལ་ཡང་མེད། མིའམ་ཅིའི་བུ་མོ་ལ་ཡང་མེད། ལྟོ་འཕྱེ་ཆེན་པོ་ལ་ཡང་མེད།
en: There was no equal to that girl’s body in the worlds in the ten directions, let alone one that was superior.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་ལ་ཡང་མེད། མི་ལ་ཡང་མེད། མིའི་བུ་མོ་ལ་ཡང་མེད་ཅིང་མི་སྲིད་པ་དེ་ལྟ་བུའི་དྲི་ཞིམ་པོ་ཚོར་བར་གྱུར་ཏོ། བུད་མེད་དེའི་གཟུགས་དང་མཉམ་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་། ཁ་དོག་དང་མདོག་དེ་ལྟ་བུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་དང་ཁ་དོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བའི་ཁ་དོག་དང་མདོག་མ་གཏོགས་པར་དེའི་ཁ་དོག་དང་། མདོག་ཏུ་མཉམ་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the luster of the color of the bodies of the tathāgatas, and the luster of the color of consecrated bodhisattvas, there was no one in the worlds in the ten directions who had a body with a luster of color that equaled the luster of color of her body, let alone one that was superior.

source: ལུས་ཀྱི་ཆུ་ཞེང་དང་དབྱིབས་དེ་ལ་བུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཁྲུན་ཆུ་ཞེང་དང་། དབྱིབས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པའི་ལུས་ཀྱི་ཆུ་ཞེང་དང་། དབྱིབས་མ་གཏོགས་པར་དེའི་ལུས་ཀྱི་ཆུ་ཞེང་དང་དབྱིབས་སུ་མཉམ་པ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the shape and figure of the bodies of the tathāgatas, and the shape and figure of consecrated bodhisattvas, there was no one in the worlds in the ten directions who had a body with a shape and figure that equaled the shape and figure of her body, let alone one that was superior.

source: འོད་ཀྱི་རྒྱན་དེ་ལྟ་བུའང་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱི་རྒྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པའི་འོད་ཀྱི་རྒྱན་མ་གཏོགས་པར་དེའི་འོད་ཀྱི་རྒྱན་དང་། མཉམ་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the aura of light of the tathāgatas, and the aura of light of consecrated bodhisattvas, there was no one in the worlds in the ten directions who had an aura of light that equaled her aura of light, let alone one that was superior.

source: དེའི་ཁའི་ངད་ཀྱི་དྲི་ཞིམ་པོ་དང་མཉམ་པའི་དྲི་དེ་ལྟ་བུ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ལྷའི་གནས་སམ། ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་གནས་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the tathāgatas and the consecrated bodhisattvas, there was no one in the worlds in the ten directions, in the realms of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, or nonhumans, who had a scent that equaled the scent of the breath that came from her mouth, let alone one that was superior.

source: ཁྱིམ་གྱི་རྒྱན་དང་། ལོངས་སྤྱོད་དེ་ལྟ་བུའང་དེ་བཞིན་གཤེགས་པའི་ལོངས་སྤྱོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པའི་ལོངས་སྤྱོད་མ་གཏོགས་པར་དེའི་ཁྱིམ་གྱི་རྒྱན་དང་། ལོངས་སྤྱོད་དུ་མཉམ་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་།
en: Apart from the displays and enjoyments of the abodes of the tathāgatas, and the displays and enjoyments of the abodes of the consecrated bodhisattvas, there was no one in the worlds in the ten directions who could equal the displays and enjoyments of her abode, let alone anyone who could be her superior.

source: གཡོག་འཁོར་ཕུན་སུམ་ཚོགས་པ། དེ་ལྟ་བུའང་དེ་བཞིན་གཤེགས་པའི་འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཕུན་སུམ་ཚོགས་པ་མ་གཏོགས་པར་དེའི་གཡོག་འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། མཉམ་པ་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་མེད་ན་ལྷག་པ་ལྟ་ག་ལས་འོང་སྟེ།
en: Apart from the perfect entourage of attendants of the tathāgatas and the perfect entourage of attendants of the consecrated bodhisattvas, there was no one in the worlds in the ten directions who could equal her perfect entourage of attendants, let alone anyone who could be her superior.

source: དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ལ་འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ཀྱིས་བལྟ་བར་ནུས་པའི་སེམས་ཅན་དེ་ལྟ་བུའང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་གྱི་རིས་ན་མེད་དོ།
en: There was no being among the classes of beings in the worlds in the ten directions who could look upon the upāsikā Acalā with desire.

source: །དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་མཐོང་མ་ཐག་དུ་ཉོན་མོངས་པ་ཞི་བར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་སེམས་ཅན་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་སེམས་ཅན་གྱི་རིས་ན་མེད་དེ། འདི་ལྟ་སྟེ་དཔེར་ན།
en: There was no being among the classes of beings in the worlds in the ten directions whose kleśas did not cease as soon as they saw the upāsikā Acalā.

source: ཚངས་པ་ཆེན་པོ་སྟོང་ཕྲག་བཅུ་ལ་དབང་སྒྱུར་བ་ལ་ནི་འདོད་པ་ལ་སྤྱོད་པའི་ཉོན་མོངས་པ་རྣམས་མི་རྒྱུའོ། །དེ་བཞིན་དུ་དགེ་བསྙེན་མ་མི་གཡོ་བའང་མཐོང་མ་ཐག་ཏུ་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་མི་རྒྱུའོ།
en: Just as the Mahābrahmās who have power over a million desire realms do not have kleśas arising within them, in the same way, the beings who saw the upāsikā Acalā did not have kleśas arising within them.

source: །དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ལ་བལྟ་བས་ངོམས་པར་འགྱུར་བའི་སེམས་ཅན་དེ་ལྟ་བུའང་ཤེས་རབ་ཀྱིས་ངོམས་པ་མ་གཏོགས་པར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་གྱི་རིས་ན་མེད་དོ།
en: There was no being among the classes of beings in the worlds in the ten directions who had enough of looking upon the upāsikā Acalā, apart from those who had the contentment of wisdom.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་མི་གཡོ་བའི་ལུས་ཀྱི་བྱིན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། གཟུགས་དང་ཁ་དོག་དང་དབྱིབས་དང་། ཆུ་ཞེང་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སའི་གཞི་དང་། གྲོང་ཁྱེར་དང་རིན་པོ་ཆེ་ཐམས་ཅད་ལ་ཐོགས་པ་མེད་པའི་འོད་ཟེར་གྱི་དྲ་བའི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་ཅན་གྱི་དོན་བསམ་གྱིས་མི་ཁྱབ་པ་བསྒྲུབ་པ་མཐོང་སྟེ།
en: Sudhana, the head merchant’s son, saw the inconceivable majesty of the upāsikā Acalā’s body and her inconceivable form, color, shape, and figure; he saw the inconceivable network of unimpeded light rays from the entirety of the ground, city, and jewels; and he saw the accomplishment of inconceivable benefits for beings.

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བྱུང་བའི་དྲི་ཞིམ་པོ་ཚོར་ནས། འཁོར་རྒྱ་མཚོ་ཕུན་སུམ་ཚོགས་པ་མཐའ་ཡས་པ་མཐོང་སྟེ། ཁྱིམ་དང་གཞལ་མེད་ཁང་གི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་མི་འཕྲོགས་པ་མཐོང་ནས་ཡོན་ཏན་རྒྱ་མཚོ་ཚད་མེད་པ་ཁོང་དུ་ཆུད་དེ། དགེ་བསྙེན་མ་མི་གཡོ་བ་ལ་ཚིགས་སུ་བཅད་པ་འདིས་བསྟོད་དོ།
en: He smelled the lovely scent that arose from all her pores, saw the infinite perfect assembly of her attendants, saw the perfect, unassailable display of the aerial palace that was her home, perceived the measureless ocean of its qualities, and praised the upāsikā Acalā with this verse:

source: །ཁྱོད་ཀྱིས་རྟག་ཏུ་ཚུལ་ཁྲིམས་དྲི་མེད་ཡོངས་བསྲུངས་ཏེ།
en: “You continually maintain a stainless good conduct.

source: །བཟོད་པ་ཤིན་ཏུ་ཡངས་པའང་ཡོངས་སུ་བསྒོམས་མཛད་ཅིང་།
en: You are completely pervaded by vast patience.

source: །བརྩོན་འགྲུས་བརྟན་པ་རྡོ་རྗེ་ལྟ་བུ་བསྒྲུབས་པས་ན།
en: You are established in diligence as firm as a vajra.

source: །རི་བོའི་རྒྱལ་པོ་ལྟ་བུར་འགྲོ་བར་འཕགས་ཤིང་འབར།
en: You are superior among beings like the shining lord of mountains.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། དགེ་བསྙེན་མ་མི་གཡོ་བ་ལ་ཚིགས་སུ་བཅད་པ་དེས་མངོན་པར་བསྟོད་དེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། །ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: After Sudhana, the head merchant’s son, had praised the upāsikā Acalā with that verse, he said to her, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བས། བྱང་ཆུབ་སེམས་དཔའི་ངག་འཇམ་ཞིང་ཡིད་དུ་འོང་ལ་ཉམས་སུ་བདེ་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་དགའ་བར་འགྱུར་བའི་ཚིག་ཏུ་བརྗོད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: The upāsikā Acalā spoke with a gentle, beautiful, delightful voice to Sudhana, the head merchant’s son, with words that brought him joy, saying, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་སྙིང་པོ་ཐོབ་བ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called the essence of wisdom that is difficult to attain

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་ཡི་དམ་བརྟན་པ་ལ་སློབ་པ།
en: I train in the gateway of bodhisattva conduct that possesses a strong commitment.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་སའི་གཟུངས་ཀྱི་སྒོ་ཐོབ་པའོ།
en: I have attained the gateway of the power of retention of the level of the equality of all phenomena.

source: །ཁོ་མོ་ནི་སྦོས་པའི་ཡེ་ཤེས་སྣང་བ། ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བར་བརྗོད་པ་ཐོབ་པའོ། །ཁོ་མོ་ནི་ཆོས་ཐམས་ཅད་ཡོང་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐོབ་བའོ།
en: I have attained the gateway called the light of the wisdom of eloquence that elucidates the basis of all phenomena, and I have attained the gateway of the samādhi called the display of the tireless search for the Dharma

source: །སྨྲས་པ་འཕགས་མ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་དེའི་ཡུལ་ནི་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked, “Āryā, what is the scope of the bodhisattva liberation called the essence of the wisdom that is difficult to attain

source: ཡི་དམ་ལ་བརྟན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་སའི་གཟུངས་ཀྱི་སྒོ་དང་། ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བར་བརྗོད་པའི་སྤོབས་པ་སྣང་བའི་སྒོ་དང་། ཆོས་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོའི་ཡུལ་ནི་ཇི་ལྟ་བུ་ཞིག་མཆིས། སྨྲས་པ།
en: What is the scope of the gateway of bodhisattva conduct with a strong commitment, of the gateway of maintaining the level of the equality of all phenomena, of the gateway of the light of the wisdom of eloquence that elucidates the basis of all phenomena, and of the gateway of the samādhi called the display of the tireless search for the Dharma

source: རིགས་ཀྱི་བུ་གནས་འདི་ནི་ཡིད་ཆེས་པར་དཀའོ།
en: Acalā answered, “Noble one, this is a subject that is difficult to believe.”

source: །སྨྲས་པ་འཕགས་མ་བསྟན་དུ་གསོལ།
en: Sudhana said, “Āryā, please teach me.

source: སངས་རྒྱས་ཀྱི་བྱིན་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་ན་ཡིད་ཆེས་པར་མཆི་གྲང་། རྟོགས་པ་དང་འཚལ་བ་དང་། རྣམ་པར་རྟོགས་པ་དང་། རྗེས་སུ་རྟོགས་པ་དང་། རིག་པ་དང་། དམིགས་སུ་ཕེབས་པ་དང་། གོམས་པ་དང་། མི་འགལ་བ་དང་། རྣམ་པར་མི་རྟོག་པ་དང་། སྒྲོ་འདོགས་པ་མ་མཆིས་པ་དང་། མཉམ་པར་བགྱིད་པར་ཡང་མཆི་གྲང་།
en: Through the power of the buddhas and being in the care of the kalyāṇamitras, I will believe it, comprehend it, know it, understand it, discern it, cognize it, reflect upon it as a focus of my attention, contemplate it, not deny it, not conceptualize it, not add to it, and be in accord with it.”

source: དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་ཤིག་ན་དྲི་མ་མེད་པའི་འོད་ཀྱི་བསྐལ་པ་ལ། དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Then the upāsikā Acalā said to Sudhana, the head merchant’s son, “Noble one, in the past, during a kalpa called Stainless Light , appeared the tathāgata named Pralambabāhu.

source: ཁོ་མོ་ཡང་དེའི་ཚེ་རྒྱལ་པོ་གློག་གིས་བྱིན་པའི་བུ་ཅིག་མ་ཞིག་ཏུ་གྱུར་ནས།
en: At that time I was the only daughter of King Vidyuddatta.

source: དེའི་ཚེ་ནུབ་མོ་མི་ཉལ་ཙམ་ཞིག་ན་རྒྱལ་པོའི་སྒོ་ཡང་བཅད། ཕ་དང་མ་ཡང་ཉལ། སྐྱེས་བ་དང་བུད་མེད་དག་ཀྱང་གཉིད་ཀྱིས་ལོག །རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བའི་སྒྲ་ཡང་ཞི། ལྷན་ཅིག་སྤྱོད་པའི་བུད་མེད་ལྔ་བརྒྱ་ཙམ་དག་ཀྱང་ཉལ་བར་གྱུར་བ་ཞིག་ན། ཁོ་མོ་མལ་གྱི་སྟེང་ན་འདུག་ཅིང་།
en: One night when I was not sleeping, the door of the royal residence was shut, my parents were asleep, the staff of men and women had gone to sleep, the sound of music being played had ceased, and the five hundred women that I spent time with were sleeping, I sat on my bed, looking at the constellations of stars in the sky.

source: ནམ་མཁའི་དབྱིངས་ལ་རྒྱུ་བའི་སྐར་མའི་ཚོགས་ཀྱི་ཕྲེང་བ་རྣམ་པར་འཁོད་པ་ལ་ལྟ་ལྟ་བ་ལས། སྟེང་གི་བར་སྣང་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕྱག་རབ་ཏུ་བརྐྱང་བ།
en: In the sky above I saw the Tathāgata Arhat Samyak­saṃbuddha Pralambabāhu, who was like Sumeru , the lord of mountains.

source: རིའི་དབང་པོ་རི་རབ་ལྟར་ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་མང་པོས་བསྐོར་བ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་གྲངས་མེད་པས་ཡོངས་སུ་བསྐོར་བ།
en: He was accompanied by an entourage of many nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: ཕྱོགས་ཐམས་ཅད་དུ་འོད་ཟེར་གྱི་དྲ་བ་ཐོགས་པ་མེད་པས་རྒྱས་པར་ཁྱབ་པའི་སྐུ་བཞུགས་པ་མཐོང་ངོ་།
en: His body spread a network of unimpeded light rays throughout all directions.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སྐུའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཀྱང་དྲི་ཞིམ་པོ་རྣམ་པ་འདི་ལྟ་བུ་བྱུང་སྟེ། དེས་ཁོ་མོའི་ལུས་དང་སེམས་ཤིན་ཏུ་བདེ་བར་གྱུར། ཡིད་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: From all the pores of the tathāgata’s body came a beautiful scent that brought ease to my mind and body and great happiness to my mind.

source: མལ་གྱི་སྟེང་ནས་ལངས་ནས་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ་ས་ལ་བབས་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་བ་དེ་ལ་ཕྱག་འཚལ་ཏེ།
en: “I arose from my bed and stood on the floor, and with my ten fingers placed together in homage, I bowed down to the Tathāgata Pralambabāhu.

source: དེའི་སྤྱི་གཙུག་ལ་བལྟས་ནའང་། མཐར་ཐུག་པར་མ་རུང་། གཡས་གཡོན་གྱི་ཚད་ཀྱང་ཟིན་པར་མ་རུང་།
en: As I looked at the crown of his head there seemed to be no end to it, and I could not grasp his extent to the right or left.

source: མཚན་དང་དཔེ་བྱད་ཕུན་སུམ་ཚོགས་པ་ལ་བསམས་ནའང་ངོམས་པར་མ་རུང་སྟེ།
en: I could never have enough of contemplating his perfect signs and features of a great being.

source: དེའི་ཚེ་ཁོ་མོ་འདི་སྙམ་དུ་བསམས་སོ། །ལས་ཇི་ལྟ་བུ་ཞིག་བྱས་ན་ལུས་ཕུན་སུམ་ཚོགས་པ་འདི་ལྟ་བུ་ནི་འཐོབ་པར་འགྱུར།
en: “At that time, I wondered, ‘Through what kind of karma can one obtain such a perfect body?

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཕུན་སུམ་ཚོགས་པ་ནི་སྐྱེ་བར་འགྱུར།
en: Give rise to the perfect signs and features of a great bring?

source: འོད་ཀྱི་རྒྱན་ཕུན་སུམ་ཚོགས་པ་ནི་འབྱུང་བར་འགྱུར།
en: Have such a perfect display of light?

source: འཁོར་ཕུན་སུམ་ཚོགས་པ་ནི་འགྲུབ་པར་འགྱུར།
en: Attain such a perfect entourage?

source: ཡིད་ཀྱི་རང་བཞིན་གྱི་གནས་དང་། ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས་པ་ནི་འབྱུང་བར་འགྱུར།
en: Have such a perfect residence and requisites that are of the nature of the mind?

source: བསོད་ནམས་ཕུན་སུམ་ཚོགས་པ་ནི་སྐྱེ་བར་འགྱུར།
en: Develop such a perfection of merit?

source: ཡེ་ཤེས་ཕུན་སུམ་ཚོགས་པ་ནི་རྣམ་པར་དག་པར་འགྱུར།
en: Have such purified wisdom?

source: ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཕུན་སུམ་ཚོགས་པ་ནི་ཡང་དག་པར་འགྲུབ་པར་འགྱུར།
en: Attain such perfect, inconceivable miracles from samādhi?

source: གཟུངས་ཕུན་སུམ་ཚོགས་པ་ནི་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: Complete such perfect powers of retention?

source: སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ནི་དབང་དུ་འགྱུར་སྙམ་པ་དང་། རིགས་ཀྱི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་བ་དེས་ཁོ་མོའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་དེས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: And have the power of such perfect eloquence?’ “Noble one, the Bhagavat Tathāgata Pralambabāhu knew my thought and said, ‘Girl, develop an invincible motivation for the defeat of all the kleśas. Develop an undefeatable motivation for eliminating all attachment. Develop an unwearying motivation for comprehending the way of the profound Dharma.

source: །བུ་མོ་ཁྱོད་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་གཞོམ་པའི་ཕྱིར་ཐུབ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །མངོན་པར་ཞེན་པ་ཐམས་ཅད་བསལ་བའི་ཕྱིར་ཕམ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །ཆོས་ཟབ་མོའི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཞུམ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །སེམས་ཅན་བསམ་པ་མི་ཟད་པ་དང་ལྡན་པའི་རྒྱ་མཚོའི་ཀློང་དུ་ལྟུང་བས་མི་སྒུལ་བའི་སེམས་སྐྱེད་ཅིག །སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་སྐྱེ་བའི་སྐྱེ་མཆེད་དུ་མགོ་རྨོངས་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །སངས་རྒྱས་ཐམས་ཅད་བལྟ་བར་མོས་པ་རྒྱུན་མི་གཅད་པའི་ཕྱིར་ངོམས་མི་ཤེས་པའི་སེམས་སྐྱེད་ཅིག །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཆོག་མི་ཤེས་པའི་སེམས་སྐྱེད་ཅིག །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་སྣང་བ་རྟོགས་པར་བྱ་བའི་ཕྱིར་ངེས་པར་རྟོགས་པའི་སེམས་སྐྱེད་ཅིག །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་གཟུང་བའི་ཕྱིར་ཡང་དག་པར་གཟུང་བའི་སེམས་སྐྱེད་ཅིག །དེ་བཞིན་གཤེགས་པའི་ཞལ་ནས་བྱུང་བ་ཤེས་པར་བྱ་བ་ལྟ་ལ་ཅི་སྨོས་ཀྱི་ཆུང་ངུ་ན་བརྡར་བྱེད་པ་ཙམ་ལ་ཡང་འཁྲུལ་པ་མེད་པའི་སེམས་སྐྱེད་ཅིག །བུ་མོ་ཁྱོད་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་རིན་པོ་ཆེན་རྣམ་པར་དབྱེ་བའི་ཕྱིར།
en: Develop an unshakable motivation for descending into the whirling ocean of the range of the thoughts of beings. Develop an unconfused motivation for the rebirth in all the states of existence within saṃsāra. Develop a never-satisfied motivation for the continuous aspiration to see all the buddhas. Develop a never-satiated motivation in order to obtain the clouds of Dharma of all the buddhas. Develop a realized motivation in order to realize the light of the way of the Dharma of all the buddhas. Develop an acquisitive motivation for acquiring the Dharma wheels of all the buddhas. Develop a motivation to be without delusion concerning even a small gesture, let alone to know that which comes from a tathāgata’s mouth.

source: རྣམ་པར་དབྱེ་བའི་སེམས་སྐྱེད་ཅིག་ཅེས་བྱུང་སྟེ།
en: Girl, you should develop the motivation to distribute the precious Dharma in accordance with the aspirations of beings.’

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕྱག་རབ་ཏུ་བརྐྱང་བ་ལས། ཆོས་ཀྱི་ཚུལ་གྱི་གདམས་ངག་གི་སྒོ་རྣམ་པ་དེ་ལྟ་བ་དག་ཐོས་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ནི་མངོན་པར་མོས་པར་གྱུར།
en: “Noble one, I heard from the Bhagavat Tathāgata Arhat Samyak­saṃbuddha Pralambabāhu, that king of the gateways of instruction to the way of the Dharma, and I longed to attain omniscient wisdom.

source: སྟོབས་བཅུའི་རང་བཞིན་ལ་ནི་མངོན་པར་སྨོན་པར་གྱུར།
en: I aspired to the nature of the strengths.

source: སངས་རྒྱས་གསུང་ལ་ནི་མངོན་པར་དད་པར་གྱུར།
en: I wished for the words of the Buddha.

source: སངས་རྒྱས་ཀྱི་འོད་ཀྱི་རྒྱན་ནི་ཡོངས་སུ་སྦྱང་བར་དགའ།
en: I wanted to have the purified display of light of a buddha.

source: སངས་རྒྱས་ཀྱི་སྐུ་ཕུན་སུམ་ཚོགས་པ་ནི་ཡོངས་སུ་བསྒྲུབ་པར་དགའ།
en: I wanted to attain the perfect body of a buddha.

source: སངས་རྒྱས་ཀྱི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམ་པར་དག་པ་ལ་ནི་མངོན་པར་མོས་པར་གྱུར།
en: I longed to have a buddha’s pure signs and features of a great being.

source: སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་མངོན་པར་སྨོན་པར་གྱུར།
en: I aspired to have the perfect assembly of followers of a buddha.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་ལ་ནི་མངོན་པར་དད་པར་གྱུར།
en: I wished for the pure realms of a buddha.

source: སངས་རྒྱས་ཀྱི་སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་མངོན་པར་མོས་པར་གྱུར།
en: I longed for the perfect conduct of a buddha.
